src/app/code/community/EbayEnterprise/Eb2cOrder/Test/Model/Customer/Order/DetailTest/fixtures/blah.xml

<?xml version="1.0" encoding="UTF-8"?>
<OrderDetailResponse xmlns="http://api.gsicommerce.com/schema/checkout/1.0" orderType="SALES"
                     testType=""
                     cancellable="false">
   <Order customerOrderId="0005400000001" levelOfService="REGULAR">
      <Customer customerId="00008">
         <Name>
            <LastName>van Brug</LastName>
            <FirstName>Scott</FirstName>
         </Name>
         <EmailAddress>svanbrug@ebau.com</EmailAddress>
         <CustomerTaxId/>
         <TaxExemptFlag>false</TaxExemptFlag>
      </Customer>
      <CreateTime>2014-05-08T14:17:14+00:00</CreateTime>
      <OrderItems>
         <OrderItem id="item2014050814173327259799" webLineId="1">
            <ItemId>45-HTCT60</ItemId>
            <Quantity>1</Quantity>
            <Description>
               <Description>Louis Vuitton Handbag</Description>
            </Description>
            <Pricing>
               <Merchandise>
                  <Amount>500.00</Amount>
                  <PromotionalDiscounts>
                     <Discount appliedCount="1">
                        <Id>MAGT1-3</Id>
                        <Code>15PerOff</Code>
                        <Amount>75.00</Amount>
                        <Description/>
                        <EffectType>by_percent</EffectType>
                        <TaxData>
                           <Taxes>
                              <Tax taxType="SALES" taxability="TAXABLE">
                                 <Situs>ADMINISTRATIVE_ORIGIN</Situs>
                                 <Jurisdiction jurisdictionLevel="STATE" jurisdictionId="31152">PENNSYLVANIA</Jurisdiction>
                                 <Imposition impositionType="General Sales and Use Tax">Sales and Use Tax</Imposition>
                                 <EffectiveRate>0.000</EffectiveRate>
                                 <TaxableAmount>0</TaxableAmount>
                                 <CalculatedTax>0.00</CalculatedTax>
                              </Tax>
                           </Taxes>
                        </TaxData>
                     </Discount>
                  </PromotionalDiscounts>
                  <TaxData>
                     <TaxClass>76684</TaxClass>
                     <Taxes>
                        <Tax taxType="SALES" taxability="TAXABLE">
                           <Situs>ADMINISTRATIVE_ORIGIN</Situs>
                           <Jurisdiction jurisdictionLevel="STATE" jurisdictionId="31152">PENNSYLVANIA</Jurisdiction>
                           <Imposition impositionType="General Sales and Use Tax">Sales and Use Tax</Imposition>
                           <EffectiveRate>0.060</EffectiveRate>
                           <TaxableAmount>425</TaxableAmount>
                           <CalculatedTax>25.50</CalculatedTax>
                        </Tax>
                     </Taxes>
                  </TaxData>
                  <UnitPrice>500.00</UnitPrice>
               </Merchandise>
               <Shipping>
                  <Amount>0.00</Amount>
                  <TaxData>
                     <TaxClass>93000</TaxClass>
                     <Taxes>
                        <Tax taxType="SALES" taxability="TAXABLE">
                           <Situs>ADMINISTRATIVE_ORIGIN</Situs>
                           <Jurisdiction jurisdictionLevel="STATE" jurisdictionId="31152">PENNSYLVANIA</Jurisdiction>
                           <Imposition impositionType="General Sales and Use Tax">Sales and Use Tax</Imposition>
                           <EffectiveRate>0.000</EffectiveRate>
                           <TaxableAmount>0</TaxableAmount>
                           <CalculatedTax>0.00</CalculatedTax>
                        </Tax>
                     </Taxes>
                  </TaxData>
                  <UnitPrice>0.00</UnitPrice>
               </Shipping>
               <Duty>
                  <TaxData/>
               </Duty>
            </Pricing>
            <Carrier mode="STD">ANY</Carrier>
            <FulfillmentChannel>SHIP_TO_HOME</FulfillmentChannel>
            <EstimatedDeliveryDate>
               <DeliveryWindow>
                  <From>2014-05-11T14:18:31+00:00</From>
                  <To>2014-05-14T14:18:31+00:00</To>
               </DeliveryWindow>
               <ShippingWindow>
                  <From>2014-05-09T14:18:31+00:00</From>
                  <To>2014-05-09T14:18:31+00:00</To>
               </ShippingWindow>
               <Mode>LEGACY</Mode>
               <MessageType>NONE</MessageType>
               <Template>You can expect to receive your item(s) between {0,date} and {1,date}.</Template>
               <OriginalExpectedShipmentDate>
                  <From>2014-05-09T14:16:54+00:00</From>
                  <To>2014-05-09T14:16:54+00:00</To>
               </OriginalExpectedShipmentDate>
               <OriginalExpectedDeliveryDate>
                  <From>2014-05-11T14:16:54+00:00</From>
                  <To>2014-05-14T14:16:54+00:00</To>
               </OriginalExpectedDeliveryDate>
            </EstimatedDeliveryDate>
            <VendorId>28001</VendorId>
            <Statuses>
               <Status>
                  <Quantity>1</Quantity>
                  <Status>Released</Status>
                  <StatusDate>2014-05-15T20:14:57+00:00</StatusDate>
                  <ProductAvailabilityDate>2014-05-15</ProductAvailabilityDate>
                  <Warehouse>GSI-DC224</Warehouse>
               </Status>
            </Statuses>
            <OMSLineId>1-1</OMSLineId>
            <GiftRegistryCancelUrl/>
            <ReservationId>MAGTNA-MAGT1-12</ReservationId>
         </OrderItem>
      </OrderItems>
      <Shipping>
         <ShipGroups>
            <ShipGroup id="shipGroup_1" chargeType="FLATRATE">
               <DestinationTarget ref="dest_1"/>
               <OrderItems>
                  <Item ref="item2014050814173327259799"/>
               </OrderItems>
            </ShipGroup>
         </ShipGroups>
         <Destinations>
            <MailingAddress id="dest_1">
               <PersonName>
                  <LastName>van Brug</LastName>
                  <FirstName>Scott</FirstName>
               </PersonName>
               <Address>
                  <Line1>630 Allendale Rd</Line1>
                  <City>King of Prussia</City>
                  <MainDivision>PA</MainDivision>
                  <CountryCode>US</CountryCode>
                  <PostalCode>19406-1418</PostalCode>
               </Address>
               <Phone>5555555555</Phone>
            </MailingAddress>
            <MailingAddress>
               <PersonName>
                  <LastName>van Brug</LastName>
                  <FirstName>Scott</FirstName>
               </PersonName>
               <Address>
                  <Line1>630 Allendale Rd</Line1>
                  <City>King of Prussia</City>
                  <MainDivision>PA</MainDivision>
                  <CountryCode>US</CountryCode>
                  <PostalCode>19406-1418</PostalCode>
               </Address>
               <Phone>5555555555</Phone>
            </MailingAddress>
            <MailingAddress id="billing_1">
               <PersonName>
                  <LastName>van Brug</LastName>
                  <FirstName>Scott</FirstName>
               </PersonName>
               <Address>
                  <Line1>630 Allendale Rd</Line1>
                  <City>King of Prussia</City>
                  <MainDivision>PA</MainDivision>
                  <CountryCode>US</CountryCode>
                  <PostalCode>19406-1418</PostalCode>
               </Address>
               <Phone>5555555555</Phone>
            </MailingAddress>
            <MailingAddress>
               <PersonName>
                  <LastName>van Brug</LastName>
                  <FirstName>Scott</FirstName>
               </PersonName>
               <Address>
                  <Line1>630 Allendale Rd</Line1>
                  <City>King of Prussia</City>
                  <MainDivision>PA</MainDivision>
                  <CountryCode>US</CountryCode>
                  <PostalCode>19406-1418</PostalCode>
               </Address>
               <Phone>5555555555</Phone>
            </MailingAddress>
         </Destinations>
      </Shipping>
      <Payment>
         <BillingAddress ref="billing_1"/>
         <Payments>
            <CreditCard>
               <PaymentContext>
                  <PaymentSessionId/>
                  <TenderType>VC</TenderType>
                  <PaymentAccountUniqueId isToken="true">4000007YpA6s0101</PaymentAccountUniqueId>
               </PaymentContext>
               <Amount>0.00</Amount>
               <Authorization>
                  <ResponseCode/>
                  <BankAuthorizationCode/>
                  <CVV2ResponseCode/>
                  <AVSResponseCode/>
                  <AmountAuthorized>450.50</AmountAuthorized>
               </Authorization>
               <ExpirationDate>2015-12</ExpirationDate>
            </CreditCard>
         </Payments>
         <Status>AUTHORIZED</Status>
      </Payment>
      <Currency>USD</Currency>
      <TaxHeader>
         <Error>false</Error>
      </TaxHeader>
      <Locale>en_US</Locale>
      <Status>Released</Status>
      <OrderHistoryUrl>http://10.9.195.65/es/sales/order/view/order_id/1/</OrderHistoryUrl>
      <ExchangeOrders/>
   </Order>
</OrderDetailResponse>
